[
  {
    "section": "clubs",
    "name": "N.E.R.D.S.",
    "description": "NIT Silchar Embedded and Robotics Development Society, is the official robotics club of NIT Silchar. Aim to foster creativity, technical innovation, and hands-on learning through robotics and automation.",
    "logo": "",
    "link": "https://www.nerdsnitsilchar.in/"
  },
  {
    "section": "clubs", 
    "name": "ML club",
    "description": "Machine Learning Club of NIT Silchar, where we foster a vibrant community of students passionate about artificial intelligence and machine learning. ",
    "logo": "",
    "link": "https://www.mlclubnits.com/"
  },
  {
    "section": "clubs",
    "name": "GDGC",
    "description": "Google Developer Group on Campus, NIT Silchar is one of the global part of Google Developer Group on Campus. GDGC focuses on solving real-life problems in and around our society by developing meaningful products",
    "logo": "",
    "link": "https://gdscnits.in/"
  },
  {
    "section": "clubs",
    "name": "E-cell",
    "description": "E-Cell, NIT Silchar is a non-profit student-run organization promoting and nurturing the entrepreneurial spirit among students. It offers pre-incubation facilities to startups and encourages students to work on their ideas through events.",
    "logo": "",
    "link": "https://ecellnits.org/"
  },
  {
    "section": "clubs",
    "name": "Symphonits",
    "description": "ᴍᴜsɪᴄ ᴄʟᴜʙ ᴏғ ɴɪᴛ sɪʟᴄʜᴀʀ, 𝙻𝚎𝚝 𝚝𝚑𝚎 𝚖𝚞𝚜𝚒𝚌 𝚜𝚙𝚎𝚊𝚔 𝚏𝚘𝚛 𝚒𝚝𝚜𝚎𝚕𝚏✨",
    "logo": "",
    "link": "https://www.instagram.com/sympho.nits__/?hl=en"
  },
  {
    "section": "clubs",
    "name": "Advay",
    "description": "Unleash the Drama within... Join the Stage, Where Drama Meets Family: Uniting Hearts on Stage..!!",
    "logo": "",
    "link": "https://www.instagram.com/advaynits/?hl=en"
  },
  {
    "section": "clubs",
    "name": "Obiettivo",
    "description": "Obiettivo is the official photography club of NIT Silchar that functions under the supreme body of Gymkhana.",
    "logo": "",
    "link": "https://www.instagram.com/obiettivo_official/?hl=en"
  },
  {
    "section": "clubs",
    "name": "Aaveg",
    "description": "The official dance club of NIT Silchar, where rhythm, expression, and passion come together to set the stage on fire.",
    "logo": "",
    "link": "https://www.instagram.com/danceclubnits/?hl=en"
  },
  {
    "section": "clubs",
    "name": "NITSMUN",
    "description": "The official MUN society of NIT Silchar, fostering diplomacy, debate, and global leadership through simulated international forums.",
    "logo": "",
    "link": "https://www.nitsmun.co.in/"
  },
  {
    "section": "clubs",
    "name": "Quiz Club",
    "description": "The knowledge hub of NIT Silchar, sharpening minds through quizzes that challenge curiosity, logic, and awareness across domains.",
    "logo": "",
    "link": "https://www.instagram.com/quizclub_nits/"
  },
  {
    "section": "clubs",
    "name": "ECO Club",
    "description": "The environmental society of NIT Silchar, promoting sustainability, conservation, and eco-conscious action for a greener future.",
    "logo": "",
    "link": "https://www.instagram.com/eco_club_nits/?hl=en"
  },
  {
    "section": "clubs",
    "name": "Dojo",
    "description": "Karate Club (Dojo) — The martial arts society of NIT Silchar, instilling discipline, strength, and self-defence through the art of karate. 🥋",
    "logo": "",
    "link": "https://www.instagram.com/dojo.nits/"
  },
  {
    "section": "clubs",
    "name": "Yoga Club",
    "description": "The wellness society of NIT Silchar, nurturing physical fitness, mental peace, and holistic well-being through the practice of yoga",
    "logo": "",
    "link": "https://www.instagram.com/yoga_club_nits/?__d=1"
  },
  {
    "section": "clubs",
    "name": "NITS Cricket",
    "description": "The official cricket fraternity of NIT Silchar, uniting skill, strategy, and sportsmanship on and off the pitch.",
    "logo": "",
    "link": "https://www.instagram.com/nits_cricket/?hl=en"
  },
  {
    "section": "clubs",
    "name": "Adventure Club",
    "description": "TAdventure & Trekking Club — The thrill-seeking society of NIT Silchar, exploring the outdoors through treks, expeditions, and a spirit of adventure.",
    "logo": "",
    "link": "https://www.instagram.com/adventureclub_nits/"
  },
  {
    "section": "clubs",
    "name": "Illumminits",
    "description": "Literary, Publication & Fine Arts Society — The creative society of NIT Silchar that celebrates literature, art, and expression through words, visuals, and imagination.",
    "logo": "",
    "link": "https://www.instagram.com/illuminits/?hl=en"
  },
   {
    "section": "clubs",
    "name": "Finance Club",
    "description": "Finance Club (NIT Silchar Management) — The finance and management society of NIT Silchar, empowering students with financial literacy, strategic thinking, and real-world business insights.",
    "logo": "",
    "link": "https://rocketreach.co/finance-club-nit-silchar-management_b7069ed9c51d36c8"
  },
   {
    "section": "clubs",
    "name": "NITS Esports",
    "description": "The official competitive gaming community of NIT Silchar, where passionate gamers unite to battle in tournaments, build skills, and represent the institute in esports events.",
    "logo": "",
    "link": "https://www.nitsesports.in/"
  },
   {
    "section": "clubs",
    "name": "Hindi Sahitya Samiti",
    "description": "he Hindi literary society of NIT Silchar, dedicated to promoting Hindi literature, poetry, and cultural expression through words and creativity.",
    "logo": "",
    "link": "https://www.instagram.com/hindisahityasamitinits/"
  },
   {
    "section": "clubs",
    "name": "Khokho club",
    "description": "The traditional sports club of NIT Silchar, fostering agility, teamwork, and competitive spirit through the fast-paced game of Kho-Kho.",
    "logo": "",
    "link": "https://www.instagram.com/nitsilchar_khokho/?hl=en"
  },
   {
    "section": "clubs",
    "name": "ASTRA",
    "description": "To the stars, through hardship! A budding community of astronomy and space technology enthusiasts of NIT Silchar",
    "logo": "",
    "link": "https://www.instagram.com/astra.nits/"
  },
  {
    "section": "branch societies",
    "name": "Computer Science Society (CSS)",
    "description": "The students and the faculty of the Computer Science and Engineering Department are the members of the Society. The Society aims at organising various activities for the professional and intellectual development of the students. It involves a wide variety of events including seminars, paper presentations, debate, quiz and software contests.The society also organises socialisation programmes for the freshmen in the society.",
    "logo": "",
    "link": "https://www.css-nits.in/"
  },
  {
    "section": "branch societies",
    "name": "ELECTRONICS & COMMUNICATION SOCIETY (ECS)",
    "description": "he Electronics and Telecommunication Department has an active Society called “Electronics Society” which has been formed with a view to promote various technical activities among the students. Both the faculty and the students are the members of the Society.",
    "logo": "",
    "link": "https://ecs-website2023-mu.vercel.app/"
  },
  {
    "section": "branch societies", 
    "name": "Instrumentation and Electronics Engineering Society (INSEES)",
    "description": "The Department of Electronics & Instrumentation Engineering (EIE) has a society, the INSEES (Instrumentation and Electronics Engineering Society), comprising of the faculty and student members of the department. The society has been formed with a view to promote various technical activities among the students. It aims to play an active role in the development of students as potential engineers by various out-of-curriculum and extra-curricular activities including organizing of seminars, paper presentations, debate, quiz and software contests. The society also organises socialisation programmes for the freshmen in the society.",
    "logo": "",
    "link": "https://www.insees.in/"
  },
  {
    "section": "branch societies",
    "name": "Electra (Electrical Engineering Society)",
    "description": "The Electrical Engineering Society aims at guiding the students to undertake various activities like technical seminars and debates on various fields of electrical engineering which enables the students to keep pace with the rapidly changing technology.",
    "logo": "",
    "link": "https://www.electrasocietynits.com/"
  },
  {
    "section": "branch societies",
    "name": "Civil Engineering Society (CES)",
    "description": "The students and the staff of the Civil Engineering Department are the members of the Society. The Society aims at organising various activities for the professional development of the students. The most important function organised annually by the Society is “aaghaz”. It involves a wide variety of events including seminars, paper presentations, debate, quiz and software contests.",
    "logo": "",
    "link": "https://www.instagram.com/civilengineeringsocietynits/?hl=en"
  },
  {
    "section": "branch societies",
    "name": "Mechanical Engineering Society (MES)",
    "description": "The Mechanical Engineering Society, called “MES” is an integral part of the Department which aims at bringing the best out of the students and helping them hone their skills through various activities conducted by the Society. The Society is also involved in active consultancy works for the development and utilization of resources of the North-Eastern part of India.",
    "logo": "",
    "link": "https://www.facebook.com/mesnits/"
  },
  {
    "section": "others",
    "name": "IEEE Students' Branch",
    "description": "IEEE NITS (National Institute of Technology, Silchar) is one of the many student organizations working under IEEE, Institute of Electrical and Electronics Engineers, headquartered in USA. ",
    "logo": "",
    "link": "https://www.instagram.com/ieee_ras.nits/"
  },
  {
    "section": "others",
    "name": "Indian Society for Technical Education (ISTE)",
    "description": "The Institute has a very active ISTE Students’ Chapter and a Teachers’ Chapter as well. The Institute is an Institutional Menber of ISTE as well.",
    "logo": "",
    "link": ""
  },
  {
    "section": "others",
    "name": "Management Society",
    "description": "To nurture an environment for the managers to be inspiring, intercultural and ethical pioneers of change with management knowledge of global standards and to create knowledge that nurtures innovative leaders and develop leaders of enterprises who add value to society and nation-building.",
    "logo": "",
    "link": ""
  },
  {
    "section": "others", 
    "name": "NSS",
    "description": "National Service Scheme, NIT Silchar. NOT ME BUT YOU. A Government Organisation. Official Account Of NSS Cell, NIT SILCHAR",
    "logo": "",
    "link": "https://www.instagram.com/nss_nits/"
  },
  {
    "section": "others",
    "name": "IEI NIT Silchar",
    "description": "The Institution of Engineers (India) Student's Chapter, NIT Silchar",
    "logo": "",
    "link": "https://www.instagram.com/iei.nitsilchar/"
  },
  {
    "section": "others",
    "name": "ASME NITS",
    "description": "ASME NIT Silchar Student Section",
    "logo": "",
    "link": "http://asmenits.org/"
  },
  {
    "section": "others",
    "name": "MATLAB SA NITS",
    "description": "MATLAB Student Ambassador, NIT Silchar",
    "logo": "",
    "link": "https://linktr.ee/mathworksnits"
  },
  {
    "section": "others",
    "name": "Gyansagar",
    "description": "The knowledge and mentoring initiative of NIT Silchar, dedicated to sharing wisdom, guiding peers, and fostering holistic academic growth.",
    "logo": "",
    "link": "https://www.instagram.com/gyansagar.npo.nits/"
  },
  {
    "section": "others",
    "name": "NCC NIT Silchar",
    "description": "A disciplined youth organization of NIT Silchar that instills leadership, patriotism, and a spirit of service through structured military training.",
    "logo": "",
    "link": "https://www.instagram.com/ncc_nits/?hl=en"
  }
]